{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Neo4j and Reactome"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri = \"bolt://localhost:7687\", auth = (\"neo4j\",\"neo4j\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. How many nodes of Pathways, Drugs and Diseases"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(387, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>dbid</th>\n",
       "      <th>defn</th>\n",
       "      <th>synonym</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>disease</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>cancer</th>\n",
       "      <td>1500689</td>\n",
       "      <td>A disease of cellular proliferation that is ma...</td>\n",
       "      <td>[malignant tumor, malignant neoplasm, primary ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>lung squamous cell carcinoma</th>\n",
       "      <td>1981182</td>\n",
       "      <td>None</td>\n",
       "      <td>[squamous cell carcinoma of lung (disorder), E...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>head and neck squamous cell carcinoma</th>\n",
       "      <td>1248679</td>\n",
       "      <td>None</td>\n",
       "      <td>[carcinoma of the head and neck, squamous cell...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>breast cancer</th>\n",
       "      <td>1500576</td>\n",
       "      <td>A thoracic cancer that originates in the mamma...</td>\n",
       "      <td>[malignant tumor of the breast, mammary cancer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ovarian cancer</th>\n",
       "      <td>1500575</td>\n",
       "      <td>None</td>\n",
       "      <td>[ovarian neoplasm, malignant tumour of ovary, ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          dbid  \\\n",
       "disease                                          \n",
       "cancer                                 1500689   \n",
       "lung squamous cell carcinoma           1981182   \n",
       "head and neck squamous cell carcinoma  1248679   \n",
       "breast cancer                          1500576   \n",
       "ovarian cancer                         1500575   \n",
       "\n",
       "                                                                                    defn  \\\n",
       "disease                                                                                    \n",
       "cancer                                 A disease of cellular proliferation that is ma...   \n",
       "lung squamous cell carcinoma                                                        None   \n",
       "head and neck squamous cell carcinoma                                               None   \n",
       "breast cancer                          A thoracic cancer that originates in the mamma...   \n",
       "ovarian cancer                                                                      None   \n",
       "\n",
       "                                                                                 synonym  \n",
       "disease                                                                                   \n",
       "cancer                                 [malignant tumor, malignant neoplasm, primary ...  \n",
       "lung squamous cell carcinoma           [squamous cell carcinoma of lung (disorder), E...  \n",
       "head and neck squamous cell carcinoma  [carcinoma of the head and neck, squamous cell...  \n",
       "breast cancer                          [malignant tumor of the breast, mammary cancer...  \n",
       "ovarian cancer                         [ovarian neoplasm, malignant tumour of ovary, ...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (d:Disease)\\\n",
    "        RETURN d.name, d.definition, d.dbId, d.synonym'\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'disease': item.values()[0][0],\\\n",
    "                      'defn': item.values()[1],\\\n",
    "                      'dbid': item.values()[2],\\\n",
    "                      'synonym':item.values()[3]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df = df.set_index('disease')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(20959, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>class</th>\n",
       "      <th>species</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Autophagy</th>\n",
       "      <td>R-HSA-9612973</td>\n",
       "      <td>TopLevelPathway</td>\n",
       "      <td>Homo sapiens</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Chaperone Mediated Autophagy</th>\n",
       "      <td>R-HSA-9613829</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Homo sapiens</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-HSA-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Homo sapiens</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-MMU-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Mus musculus</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-RNO-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Rattus norvegicus</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-CFA-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Canis familiaris</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-BTA-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Bos taurus</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-SSC-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Sus scrofa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-DRE-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Danio rerio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lipophagy</th>\n",
       "      <td>R-XTR-9613354</td>\n",
       "      <td>Pathway</td>\n",
       "      <td>Xenopus tropicalis</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         ID            class  \\\n",
       "name                                                           \n",
       "Autophagy                     R-HSA-9612973  TopLevelPathway   \n",
       "Chaperone Mediated Autophagy  R-HSA-9613829          Pathway   \n",
       "Lipophagy                     R-HSA-9613354          Pathway   \n",
       "Lipophagy                     R-MMU-9613354          Pathway   \n",
       "Lipophagy                     R-RNO-9613354          Pathway   \n",
       "Lipophagy                     R-CFA-9613354          Pathway   \n",
       "Lipophagy                     R-BTA-9613354          Pathway   \n",
       "Lipophagy                     R-SSC-9613354          Pathway   \n",
       "Lipophagy                     R-DRE-9613354          Pathway   \n",
       "Lipophagy                     R-XTR-9613354          Pathway   \n",
       "\n",
       "                                         species  \n",
       "name                                              \n",
       "Autophagy                           Homo sapiens  \n",
       "Chaperone Mediated Autophagy        Homo sapiens  \n",
       "Lipophagy                           Homo sapiens  \n",
       "Lipophagy                           Mus musculus  \n",
       "Lipophagy                      Rattus norvegicus  \n",
       "Lipophagy                       Canis familiaris  \n",
       "Lipophagy                             Bos taurus  \n",
       "Lipophagy                             Sus scrofa  \n",
       "Lipophagy                            Danio rerio  \n",
       "Lipophagy                     Xenopus tropicalis  "
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (p:Pathway)\\\n",
    "        RETURN p.displayName, p.schemaClass, p.stId, p.speciesName'\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'name': item.values()[0],\\\n",
    "                      'class': item.values()[1],\\\n",
    "                      'ID': item.values()[2],\\\n",
    "                      'species':item.values()[3]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df = df.set_index('name')\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(222, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>dispname</th>\n",
       "      <th>species</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>[trastuzumab, herceptin, D5v8, R-597]</th>\n",
       "      <td>R-ALL-9634466</td>\n",
       "      <td>trastuzumab [extracellular region]</td>\n",
       "      <td>9634466</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[CP-724714]</th>\n",
       "      <td>R-ALL-9649889</td>\n",
       "      <td>CP-724714 [cytosol]</td>\n",
       "      <td>9649889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Afatinib, BIBW2992, Irreversible TKI inhibitor afatinib generic inhibits  EGFR and  ERBB2 (HER2)]</th>\n",
       "      <td>R-ALL-1220577</td>\n",
       "      <td>Afatinib [cytosol]</td>\n",
       "      <td>1220577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[AZ5104]</th>\n",
       "      <td>R-ALL-9649879</td>\n",
       "      <td>AZ5104 [cytosol]</td>\n",
       "      <td>9649879</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Sapitinib]</th>\n",
       "      <td>R-ALL-9649894</td>\n",
       "      <td>Sapitinib [cytosol]</td>\n",
       "      <td>9649894</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Tesevatinib, EXEL-7647, XL-647, KD-019, XL647]</th>\n",
       "      <td>R-ALL-9646810</td>\n",
       "      <td>Tesevatinib [cytosol]</td>\n",
       "      <td>9646810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Lapatinib, GW572016, Tykerb, Reversible tyrosine kinase inhibitor lapatinib generic inhibits EGFR and ERBB2 (HER2)]</th>\n",
       "      <td>R-ALL-1216521</td>\n",
       "      <td>Lapatinib [cytosol]</td>\n",
       "      <td>1216521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Neratinib, HKI-272, afatinib, Irreversible tyrosine kinase inhibitor HKI-272 generic inhibits EGFR and ERBB2 (HER2)]</th>\n",
       "      <td>R-ALL-1216527</td>\n",
       "      <td>Neratinib [cytosol]</td>\n",
       "      <td>1216527</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[AEE788]</th>\n",
       "      <td>R-ALL-9652364</td>\n",
       "      <td>AEE788 [cytosol]</td>\n",
       "      <td>9652364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>[Canertinib, CI-1033, Irreversible TKI inhibitor canertinib generic pan-ERBB]</th>\n",
       "      <td>R-ALL-1227677</td>\n",
       "      <td>Canertinib [cytosol]</td>\n",
       "      <td>1227677</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                               ID  \\\n",
       "name                                                                \n",
       "[trastuzumab, herceptin, D5v8, R-597]               R-ALL-9634466   \n",
       "[CP-724714]                                         R-ALL-9649889   \n",
       "[Afatinib, BIBW2992, Irreversible TKI inhibitor...  R-ALL-1220577   \n",
       "[AZ5104]                                            R-ALL-9649879   \n",
       "[Sapitinib]                                         R-ALL-9649894   \n",
       "[Tesevatinib, EXEL-7647, XL-647, KD-019, XL647]     R-ALL-9646810   \n",
       "[Lapatinib, GW572016, Tykerb, Reversible tyrosi...  R-ALL-1216521   \n",
       "[Neratinib, HKI-272, afatinib, Irreversible tyr...  R-ALL-1216527   \n",
       "[AEE788]                                            R-ALL-9652364   \n",
       "[Canertinib, CI-1033, Irreversible TKI inhibito...  R-ALL-1227677   \n",
       "\n",
       "                                                                              dispname  \\\n",
       "name                                                                                     \n",
       "[trastuzumab, herceptin, D5v8, R-597]               trastuzumab [extracellular region]   \n",
       "[CP-724714]                                                        CP-724714 [cytosol]   \n",
       "[Afatinib, BIBW2992, Irreversible TKI inhibitor...                  Afatinib [cytosol]   \n",
       "[AZ5104]                                                              AZ5104 [cytosol]   \n",
       "[Sapitinib]                                                        Sapitinib [cytosol]   \n",
       "[Tesevatinib, EXEL-7647, XL-647, KD-019, XL647]                  Tesevatinib [cytosol]   \n",
       "[Lapatinib, GW572016, Tykerb, Reversible tyrosi...                 Lapatinib [cytosol]   \n",
       "[Neratinib, HKI-272, afatinib, Irreversible tyr...                 Neratinib [cytosol]   \n",
       "[AEE788]                                                              AEE788 [cytosol]   \n",
       "[Canertinib, CI-1033, Irreversible TKI inhibito...                Canertinib [cytosol]   \n",
       "\n",
       "                                                    species  \n",
       "name                                                         \n",
       "[trastuzumab, herceptin, D5v8, R-597]               9634466  \n",
       "[CP-724714]                                         9649889  \n",
       "[Afatinib, BIBW2992, Irreversible TKI inhibitor...  1220577  \n",
       "[AZ5104]                                            9649879  \n",
       "[Sapitinib]                                         9649894  \n",
       "[Tesevatinib, EXEL-7647, XL-647, KD-019, XL647]     9646810  \n",
       "[Lapatinib, GW572016, Tykerb, Reversible tyrosi...  1216521  \n",
       "[Neratinib, HKI-272, afatinib, Irreversible tyr...  1216527  \n",
       "[AEE788]                                            9652364  \n",
       "[Canertinib, CI-1033, Irreversible TKI inhibito...  1227677  "
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (d:Drug)\\\n",
    "        RETURN d.displayName, d.name, d.stId, d.dbId'\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'dispname': item.values()[0],\\\n",
    "                      'name': item.values()[1],\\\n",
    "                      'ID': item.values()[2],\\\n",
    "                      'species':item.values()[3]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df = df.set_index('name')\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. How many connected nodes for 'Drug to Disease'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(349, 2)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>disease</th>\n",
       "      <th>drug</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[trastuzumab, herceptin, D5v8, R-597]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[CP-724714]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Afatinib, BIBW2992, Irreversible TKI inhibito...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[AZ5104]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Sapitinib]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    disease                                               drug\n",
       "0  [cancer]              [trastuzumab, herceptin, D5v8, R-597]\n",
       "1  [cancer]                                        [CP-724714]\n",
       "2  [cancer]  [Afatinib, BIBW2992, Irreversible TKI inhibito...\n",
       "3  [cancer]                                           [AZ5104]\n",
       "4  [cancer]                                        [Sapitinib]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (a:Drug)--(d:Disease)\\\n",
    "              RETURN a.name,d.name'\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'drug': item.values()[0],\\\n",
    "                      'disease': item.values()[1]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3. How many connected nodes for 'Disease to Pathway'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(10, 2)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>disease</th>\n",
       "      <th>pathway</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Diseases of Base Excision Repair]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Defective Base Excision Repair Associated wit...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Defective NTHL1 substrate processing]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Defective NTHL1 substrate binding]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[cancer]</td>\n",
       "      <td>[Defective Base Excision Repair Associated wit...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    disease                                            pathway\n",
       "0  [cancer]                 [Diseases of Base Excision Repair]\n",
       "1  [cancer]  [Defective Base Excision Repair Associated wit...\n",
       "2  [cancer]             [Defective NTHL1 substrate processing]\n",
       "3  [cancer]                [Defective NTHL1 substrate binding]\n",
       "4  [cancer]  [Defective Base Excision Repair Associated wit..."
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (d:Disease)--(p:Pathway)\\\n",
    "              RETURN d.name,p.name LIMIT 10'\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'disease': item.values()[0],\\\n",
    "                      'pathway': item.values()[1]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4. Counting Pathways per Disease"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(199, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pw-collect</th>\n",
       "      <th>pw-count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>disease</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>cancer</th>\n",
       "      <td>[[Diseases of Base Excision Repair], [Defectiv...</td>\n",
       "      <td>105</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Human immunodeficiency virus infectious disease</th>\n",
       "      <td>[[HIV Infection], [Host Interactions of HIV fa...</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>influenza</th>\n",
       "      <td>[[Influenza Infection], [Host Interactions wit...</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>congenital disorder of glycosylation type I</th>\n",
       "      <td>[[Defective MPDU1 causes MPDU1-CDG (CDG-1f)], ...</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>primary immunodeficiency disease</th>\n",
       "      <td>[[Diseases of Immune System], [Diseases associ...</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>bone development disease</th>\n",
       "      <td>[[Signaling by FGFR in disease], [Signaling by...</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>inherited metabolic disorder</th>\n",
       "      <td>[[Defective SLC16A1 causes symptomatic deficie...</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>botulism</th>\n",
       "      <td>[[Neurotoxicity of clostridium toxins, Clostri...</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>congenital disorder of glycosylation type II</th>\n",
       "      <td>[[Defective SLC35A1 causes congenital disorder...</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>carbohydrate metabolic disorder</th>\n",
       "      <td>[[Diseases of carbohydrate metabolism], [Pento...</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>amino acid metabolic disorder</th>\n",
       "      <td>[[Defective SLC7A7 causes lysinuric protein in...</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>T-cell leukemia</th>\n",
       "      <td>[[Signaling by NOTCH1 HD Domain Mutants in Can...</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>newborn respiratory distress syndrome</th>\n",
       "      <td>[[Defective ABCA3 causes pulmonary surfactant ...</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>congenital disorder of glycosylation</th>\n",
       "      <td>[[Diseases of glycosylation], [Diseases associ...</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>bilirubin metabolic disorder</th>\n",
       "      <td>[[Defective SLCO1B1 causes hyperbilirubinemia,...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>methylmalonic acidemia</th>\n",
       "      <td>[[Defective MMAB causes methylmalonic aciduria...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>disease</th>\n",
       "      <td>[[Disease], [Disorders of transmembrane transp...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>colorectal cancer</th>\n",
       "      <td>[[Defective Base Excision Repair Associated wi...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>tuberculosis</th>\n",
       "      <td>[[Latent infection - Other responses of Mtb to...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Rett syndrome</th>\n",
       "      <td>[[Loss of function of MECP2 in Rett syndrome],...</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                        pw-collect  \\\n",
       "disease                                                                                              \n",
       "cancer                                           [[Diseases of Base Excision Repair], [Defectiv...   \n",
       "Human immunodeficiency virus infectious disease  [[HIV Infection], [Host Interactions of HIV fa...   \n",
       "influenza                                        [[Influenza Infection], [Host Interactions wit...   \n",
       "congenital disorder of glycosylation type I      [[Defective MPDU1 causes MPDU1-CDG (CDG-1f)], ...   \n",
       "primary immunodeficiency disease                 [[Diseases of Immune System], [Diseases associ...   \n",
       "bone development disease                         [[Signaling by FGFR in disease], [Signaling by...   \n",
       "inherited metabolic disorder                     [[Defective SLC16A1 causes symptomatic deficie...   \n",
       "botulism                                         [[Neurotoxicity of clostridium toxins, Clostri...   \n",
       "congenital disorder of glycosylation type II     [[Defective SLC35A1 causes congenital disorder...   \n",
       "carbohydrate metabolic disorder                  [[Diseases of carbohydrate metabolism], [Pento...   \n",
       "amino acid metabolic disorder                    [[Defective SLC7A7 causes lysinuric protein in...   \n",
       "T-cell leukemia                                  [[Signaling by NOTCH1 HD Domain Mutants in Can...   \n",
       "newborn respiratory distress syndrome            [[Defective ABCA3 causes pulmonary surfactant ...   \n",
       "congenital disorder of glycosylation             [[Diseases of glycosylation], [Diseases associ...   \n",
       "bilirubin metabolic disorder                     [[Defective SLCO1B1 causes hyperbilirubinemia,...   \n",
       "methylmalonic acidemia                           [[Defective MMAB causes methylmalonic aciduria...   \n",
       "disease                                          [[Disease], [Disorders of transmembrane transp...   \n",
       "colorectal cancer                                [[Defective Base Excision Repair Associated wi...   \n",
       "tuberculosis                                     [[Latent infection - Other responses of Mtb to...   \n",
       "Rett syndrome                                    [[Loss of function of MECP2 in Rett syndrome],...   \n",
       "\n",
       "                                                 pw-count  \n",
       "disease                                                    \n",
       "cancer                                                105  \n",
       "Human immunodeficiency virus infectious disease        49  \n",
       "influenza                                              29  \n",
       "congenital disorder of glycosylation type I            19  \n",
       "primary immunodeficiency disease                       12  \n",
       "bone development disease                               10  \n",
       "inherited metabolic disorder                            9  \n",
       "botulism                                                8  \n",
       "congenital disorder of glycosylation type II            8  \n",
       "carbohydrate metabolic disorder                         8  \n",
       "amino acid metabolic disorder                           7  \n",
       "T-cell leukemia                                         7  \n",
       "newborn respiratory distress syndrome                   6  \n",
       "congenital disorder of glycosylation                    6  \n",
       "bilirubin metabolic disorder                            5  \n",
       "methylmalonic acidemia                                  5  \n",
       "disease                                                 5  \n",
       "colorectal cancer                                       5  \n",
       "tuberculosis                                            5  \n",
       "Rett syndrome                                           5  "
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (d:Disease)--(p:Pathway)\\\n",
    "        RETURN d.name,count(p.name),collect(p.name)'\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'disease': item.values()[0][0],\\\n",
    "                      'pw-count': item.values()[1],\\\n",
    "                      'pw-collect':item.values()[2]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df = df.set_index('disease')\n",
    "df = df.sort_values(by='pw-count', ascending=False)\n",
    "df.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5. Counting Reaction per Pathway"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(1720, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rx-collect</th>\n",
       "      <th>rx-count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>pathway</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Interconversion of nucleotide di- and triphosphates</th>\n",
       "      <td>[[AMP + ATP &lt;=&gt; ADP + ADP [AK2]], [ADP + ADP &lt;...</td>\n",
       "      <td>421</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Macroautophagy</th>\n",
       "      <td>[[ULK1 phosphorylates AMBRA1:Beclin-1 complex]...</td>\n",
       "      <td>365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Amino acid transport across the plasma membrane</th>\n",
       "      <td>[[SLC1A5-mediated exchange of glutamine and al...</td>\n",
       "      <td>363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>VEGFA-VEGFR2 Pathway</th>\n",
       "      <td>[[RHOA:GTP:Mg2+ binds ROCK1,ROCK2], [p-AXL bin...</td>\n",
       "      <td>360</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Recruitment and ATM-mediated phosphorylation of repair and signaling proteins at DNA double strand breaks</th>\n",
       "      <td>[[Formation of BRCA1-A complex at DNA DSBs], [...</td>\n",
       "      <td>356</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Synthesis of PIPs at the plasma membrane</th>\n",
       "      <td>[[MTMR8 binds MTMR9], [p-Y281,292-RUFY1 binds ...</td>\n",
       "      <td>355</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Metabolism of folate and pterines</th>\n",
       "      <td>[[ALDH1L2 dehydrogenates 10-formyl-THFPG to TH...</td>\n",
       "      <td>352</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Sphingolipid de novo biosynthesis</th>\n",
       "      <td>[[ceramide + H2O &lt;=&gt; stearate + sphingosine [e...</td>\n",
       "      <td>351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Ub-specific processing proteases</th>\n",
       "      <td>[[USP18 deubiquitinates TAK1:TAB1], [USP8 deub...</td>\n",
       "      <td>351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Gluconeogenesis</th>\n",
       "      <td>[[PXLP-K259-GOT1 dimer deaminates L-Asp, aspar...</td>\n",
       "      <td>323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Glycosphingolipid metabolism</th>\n",
       "      <td>[[Glucosylceramidase 2 cleaves the glucosidic ...</td>\n",
       "      <td>313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Integrin cell surface interactions</th>\n",
       "      <td>[[Interaction of integrin alphaEbeta7 with Cad...</td>\n",
       "      <td>311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Synthesis of bile acids and bile salts via 7alpha-hydroxycholesterol</th>\n",
       "      <td>[[4-cholesten-7alpha, 12alpha-diol-3-one is re...</td>\n",
       "      <td>307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Detoxification of Reactive Oxygen Species</th>\n",
       "      <td>[[PRDX3,5 catalyze TXN2 reduced + H2O2 =&gt; TXN2...</td>\n",
       "      <td>297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Cholesterol biosynthesis</th>\n",
       "      <td>[[Phospholipid phosphatase 6 hydrolyses Presqu...</td>\n",
       "      <td>289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Neddylation</th>\n",
       "      <td>[[COP9 signalosome deneddylates cytosolic CRL ...</td>\n",
       "      <td>283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Peptide ligand-binding receptors</th>\n",
       "      <td>[[ARBs bind AGRT1], [ECE1 cleaves EDN1(53-90)]...</td>\n",
       "      <td>278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Signaling by Hippo</th>\n",
       "      <td>[[Phosphorylation of MOB1A and B by p-STK4(MST...</td>\n",
       "      <td>272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Collagen chain trimerization</th>\n",
       "      <td>[[Association of procollagen type XVIII], [Ass...</td>\n",
       "      <td>259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Regulation of Complement cascade</th>\n",
       "      <td>[[Complement factor I binds to membrane-associ...</td>\n",
       "      <td>250</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                           rx-collect  \\\n",
       "pathway                                                                                                 \n",
       "Interconversion of nucleotide di- and triphosph...  [[AMP + ATP <=> ADP + ADP [AK2]], [ADP + ADP <...   \n",
       "Macroautophagy                                      [[ULK1 phosphorylates AMBRA1:Beclin-1 complex]...   \n",
       "Amino acid transport across the plasma membrane     [[SLC1A5-mediated exchange of glutamine and al...   \n",
       "VEGFA-VEGFR2 Pathway                                [[RHOA:GTP:Mg2+ binds ROCK1,ROCK2], [p-AXL bin...   \n",
       "Recruitment and ATM-mediated phosphorylation of...  [[Formation of BRCA1-A complex at DNA DSBs], [...   \n",
       "Synthesis of PIPs at the plasma membrane            [[MTMR8 binds MTMR9], [p-Y281,292-RUFY1 binds ...   \n",
       "Metabolism of folate and pterines                   [[ALDH1L2 dehydrogenates 10-formyl-THFPG to TH...   \n",
       "Sphingolipid de novo biosynthesis                   [[ceramide + H2O <=> stearate + sphingosine [e...   \n",
       "Ub-specific processing proteases                    [[USP18 deubiquitinates TAK1:TAB1], [USP8 deub...   \n",
       "Gluconeogenesis                                     [[PXLP-K259-GOT1 dimer deaminates L-Asp, aspar...   \n",
       "Glycosphingolipid metabolism                        [[Glucosylceramidase 2 cleaves the glucosidic ...   \n",
       "Integrin cell surface interactions                  [[Interaction of integrin alphaEbeta7 with Cad...   \n",
       "Synthesis of bile acids and bile salts via 7alp...  [[4-cholesten-7alpha, 12alpha-diol-3-one is re...   \n",
       "Detoxification of Reactive Oxygen Species           [[PRDX3,5 catalyze TXN2 reduced + H2O2 => TXN2...   \n",
       "Cholesterol biosynthesis                            [[Phospholipid phosphatase 6 hydrolyses Presqu...   \n",
       "Neddylation                                         [[COP9 signalosome deneddylates cytosolic CRL ...   \n",
       "Peptide ligand-binding receptors                    [[ARBs bind AGRT1], [ECE1 cleaves EDN1(53-90)]...   \n",
       "Signaling by Hippo                                  [[Phosphorylation of MOB1A and B by p-STK4(MST...   \n",
       "Collagen chain trimerization                        [[Association of procollagen type XVIII], [Ass...   \n",
       "Regulation of Complement cascade                    [[Complement factor I binds to membrane-associ...   \n",
       "\n",
       "                                                    rx-count  \n",
       "pathway                                                       \n",
       "Interconversion of nucleotide di- and triphosph...       421  \n",
       "Macroautophagy                                           365  \n",
       "Amino acid transport across the plasma membrane          363  \n",
       "VEGFA-VEGFR2 Pathway                                     360  \n",
       "Recruitment and ATM-mediated phosphorylation of...       356  \n",
       "Synthesis of PIPs at the plasma membrane                 355  \n",
       "Metabolism of folate and pterines                        352  \n",
       "Sphingolipid de novo biosynthesis                        351  \n",
       "Ub-specific processing proteases                         351  \n",
       "Gluconeogenesis                                          323  \n",
       "Glycosphingolipid metabolism                             313  \n",
       "Integrin cell surface interactions                       311  \n",
       "Synthesis of bile acids and bile salts via 7alp...       307  \n",
       "Detoxification of Reactive Oxygen Species                297  \n",
       "Cholesterol biosynthesis                                 289  \n",
       "Neddylation                                              283  \n",
       "Peptide ligand-binding receptors                         278  \n",
       "Signaling by Hippo                                       272  \n",
       "Collagen chain trimerization                             259  \n",
       "Regulation of Complement cascade                         250  "
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (pw:Pathway)-[:hasEvent]->(rx:Reaction)\\\n",
    "         RETURN pw.name,count(rx.name),collect(rx.name)'\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({'pathway': item.values()[0][0],\\\n",
    "                      'rx-count': item.values()[1],\\\n",
    "                      'rx-collect':item.values()[2]})\n",
    "                      \n",
    "df = pd.DataFrame(Result)\n",
    "print(df.shape)\n",
    "df = df.set_index('pathway')\n",
    "df = df.sort_values(by='rx-count', ascending=False)\n",
    "df.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Preceding Event Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record path=<Path start=<Node id=2 labels=frozenset({'Event', 'Pathway', 'DatabaseObject'}) properties={'schemaClass': 'Pathway', 'isInDisease': False, 'releaseDate': '2019-06-12', 'displayName': 'Chaperone Mediated Autophagy', 'stId': 'R-HSA-9613829', 'speciesName': 'Homo sapiens', 'diagramHeight': 1817, 'stIdVersion': 'R-HSA-9613829.2', 'dbId': 9613829, 'name': ['Chaperone Mediated Autophagy'], 'hasDiagram': True, 'isInferred': False, 'doi': '10.3180/R-HSA-9613829.1', 'diagramWidth': 2185}> end=<Node id=2468 labels=frozenset({'ReactionLikeEvent', 'Event', 'Reaction', 'DatabaseObject'}) properties={'schemaClass': 'Reaction', 'speciesName': 'Homo sapiens', 'isInDisease': False, 'releaseDate': '2019-06-12', 'displayName': 'p-GFAP:GFAP dissociates from LAMP2a multimer', 'stIdVersion': 'R-HSA-9626242.1', 'dbId': 9626242, 'name': ['p-GFAP:GFAP dissociates from LAMP2a multimer'], 'isChimeric': False, 'stId': 'R-HSA-9626242', 'category': 'dissociation', 'isInferred': False}> size=2>>\n"
     ]
    }
   ],
   "source": [
    "query = 'MATCH path = (pw:Pathway)-[:hasEvent]->(rx1:Reaction)\\\n",
    "        -[:precedingEvent*1..2]-(rx2:Reaction)\\\n",
    "        RETURN path LIMIT 1'\n",
    "\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        print(item)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "MATCH path = (pw:Pathway)-[:hasEvent]->(:Reaction)\n",
    "        -[:precedingEvent*1..5]-(:Reaction)\n",
    "        RETURN path LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
