{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "driver = GraphDatabase.driver(uri = \"bolt://localhost:7687\", auth = (\"neo4j\",\"heart\"))"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Query: Find All of the Protein Targets that are Shared Between 2 Nodes"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "source": [
    "def search_drug_intersections(tx, category: str) -> list:\n",
    "    query = (\"MATCH (c:Category) WHERE c.category = $category \"\n",
    "             \"MATCH (c)--(d:Drug)--(p) \"\n",
    "             \"MATCH (p)-[:ASSOCIATED_WITH]->(r) \"\n",
    "             \"RETURN p.protein, r.ReactomeID\")\n",
    "    result = tx.run(query, category = category)\n",
    "    return result.data()\n",
    "\n",
    "def run(category: str) -> pd.DataFrame:\n",
    "    result = driver.session().write_transaction(search_drug_intersections, category)\n",
    "    result = pd.DataFrame(result)\n",
    "    return result\n",
    "\n",
    "prompt = input(\"Enter Drug Category:\")\n",
    "print(\"Drug Targets and ReactiomeIDs for: \", prompt)\n",
    "run(prompt)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Drug Targets and ReactiomeIDs for:  Na Channel Blockers\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.protein</th>\n",
       "      <th>r.ReactomeID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Q14524</td>\n",
       "      <td>R-HSA-445095</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Q14524</td>\n",
       "      <td>R-HSA-5576892</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>P07550</td>\n",
       "      <td>R-HSA-9660821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>P07550</td>\n",
       "      <td>R-HSA-8856828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>P07550</td>\n",
       "      <td>R-HSA-8856825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>188</th>\n",
       "      <td>P26358</td>\n",
       "      <td>R-HSA-4655427</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>189</th>\n",
       "      <td>P26358</td>\n",
       "      <td>R-HSA-427413</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>190</th>\n",
       "      <td>P26358</td>\n",
       "      <td>R-HSA-212300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>191</th>\n",
       "      <td>Q14525</td>\n",
       "      <td>R-HSA-6809371</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>192</th>\n",
       "      <td>Q14525</td>\n",
       "      <td>R-HSA-6805567</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>193 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    p.protein   r.ReactomeID\n",
       "0      Q14524   R-HSA-445095\n",
       "1      Q14524  R-HSA-5576892\n",
       "2      P07550  R-HSA-9660821\n",
       "3      P07550  R-HSA-8856828\n",
       "4      P07550  R-HSA-8856825\n",
       "..        ...            ...\n",
       "188    P26358  R-HSA-4655427\n",
       "189    P26358   R-HSA-427413\n",
       "190    P26358   R-HSA-212300\n",
       "191    Q14525  R-HSA-6809371\n",
       "192    Q14525  R-HSA-6805567\n",
       "\n",
       "[193 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "execution_count": 10
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Find Shared PMIDs Between Drug Categories"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "source": [
    "def search_drug_intersections(tx, category1: str, category2: str, limit: int) -> list:\n",
    "    query = (\"MATCH (c:Category) WHERE c.category = $category1 \"\n",
    "             \"MATCH (f:Category) WHERE f.category = $category2 \"\n",
    "             \"MATCH (c)--(d:Drug)--(p) \"\n",
    "             \"MATCH (f)--(l:Drug)--(w)\"\n",
    "             \"MATCH (p)-[:PMID_TARGET]->(t)<-[:PMID_TARGET]-(w) \"\n",
    "             \"RETURN t.id LIMIT $limit\")\n",
    "    result = tx.run(query, category1 = category1, category2 = category2, limit = limit)\n",
    "    return result.data()\n",
    "\n",
    "def run(category1: str, category2: str, limit: int) -> pd.DataFrame:\n",
    "    result = driver.session().write_transaction(search_drug_intersections, category1, category2, limit)\n",
    "    result = pd.DataFrame(result)\n",
    "    return result\n",
    "\n",
    "prompt1 = input(\"Enter Drug Category 1:\")\n",
    "prompt2 = input(\"Enter Drug Category 2:\")\n",
    "prompt3 = input(\"Limit: \")\n",
    "print(\"Shared PMIDs for: \", prompt1, \"and\", prompt2, \"LIMIT:\", prompt3)\n",
    "run(prompt1, prompt2, int(prompt3))"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Shared PMIDs for:  Beta Blockers and Diuretics LIMIT: 10\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>24155982</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>28204831</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>28740174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>25863800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20174578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>26229964</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>30571258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>30571503</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>23940716</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>24155982</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       t.id\n",
       "0  24155982\n",
       "1  28204831\n",
       "2  28740174\n",
       "3  25863800\n",
       "4  20174578\n",
       "5  26229964\n",
       "6  30571258\n",
       "7  30571503\n",
       "8  23940716\n",
       "9  24155982"
      ]
     },
     "metadata": {},
     "execution_count": 25
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "-------"
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Node Similarity Algorithm"
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "@cypher:\n",
    "\n",
    "    CALL gds.graph.create(\n",
    "    'drug-protein',\n",
    "    ['Drug', 'Protein', 'Pathway'], \n",
    "    {\n",
    "      TARGET: {orientation: 'UNDIRECTED'}, ASSOCIATED_WITH: {orientation: 'UNDIRECTED'}\n",
    "    }\n",
    "    )"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "source": [
    "class NodeSimilarity():\n",
    "    \"\"\"Class to run node sim\"\"\"\n",
    "    def __init__(self) -> None:\n",
    "        self.driver = GraphDatabase.driver(\"neo4j://localhost:7687\", auth=(\"neo4j\", \"heart\"))\n",
    "\n",
    "    def close(self) -> None:\n",
    "        self.driver.close()\n",
    "\n",
    "    @classmethod\n",
    "    def nodesim(cls, tx) -> any:\n",
    "        \"\"\"\n",
    "        @param cls is the class\n",
    "        @param tx is the transaction\n",
    "        @return result.data() is the data of the cluster\n",
    "        \"\"\"\n",
    "        query = (\"\"\"\n",
    "        CALL gds.nodeSimilarity.stream('drug-protein')\n",
    "        YIELD node1, node2, similarity\n",
    "        RETURN gds.util.asNode(node1).name AS dbid1, gds.util.asNode(node2).name AS dbid2, similarity\n",
    "        ORDER BY similarity DESCENDING, dbid1, dbid1\n",
    "        \"\"\")\n",
    "        result = tx.run(query)\n",
    "        return result.data()\n",
    "\n",
    "\n",
    "    def run_nodesim(self) -> any:\n",
    "        \"\"\"\n",
    "        @param self\n",
    "        @return result is the dataframe from the pagerank\n",
    "        \"\"\"\n",
    "        result = self.driver.session().write_transaction(self.nodesim)\n",
    "        result = pd.DataFrame(result)\n",
    "        return result\n",
    "\n",
    "nodesim = NodeSimilarity()\n",
    "result = nodesim.run_nodesim()\n",
    "result = result[result['similarity'] == 1]\n",
    "result"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>dbid1</th>\n",
       "      <th>dbid2</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Canagliflozin</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Canagliflozin</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Insulin</td>\n",
       "      <td>colestipol</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Insulin</td>\n",
       "      <td>bucindolol</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Insulin</td>\n",
       "      <td>dopexamine</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2789</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2790</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2791</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2792</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2793</th>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2794 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "              dbid1       dbid2  similarity\n",
       "0     Canagliflozin        None         1.0\n",
       "1     Canagliflozin        None         1.0\n",
       "2           Insulin  colestipol         1.0\n",
       "3           Insulin  bucindolol         1.0\n",
       "4           Insulin  dopexamine         1.0\n",
       "...             ...         ...         ...\n",
       "2789           None        None         1.0\n",
       "2790           None        None         1.0\n",
       "2791           None        None         1.0\n",
       "2792           None        None         1.0\n",
       "2793           None        None         1.0\n",
       "\n",
       "[2794 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "execution_count": 139
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "source": [
    "result[:248].to_csv(\"Node Similarity\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Pagerank Algorithm"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "source": [
    "class pagerank():\n",
    "    \"\"\"Class to run pageranke\"\"\"\n",
    "    def __init__(self) -> None:\n",
    "        self.driver = GraphDatabase.driver(\"neo4j://localhost:7687\", auth=(\"neo4j\", \"heart\"))\n",
    "\n",
    "    def close(self) -> None:\n",
    "        self.driver.close()\n",
    "\n",
    "    @classmethod\n",
    "    def pagerank(cls, tx) -> any:\n",
    "        \"\"\"\n",
    "        @param cls is the xaclass\n",
    "        @param tx is the transaction\n",
    "        @return result.data() is the data of the pagerank\n",
    "        \"\"\"\n",
    "        query = (\"Call gds.pageRank.stream('drug-protein') YIELD nodeId, score RETURN gds.util.asNode(nodeId).protein AS UniProtID, score ORDER BY score DESC, UniProtID ASC\")\n",
    "        result = tx.run(query)\n",
    "        return result.data()\n",
    "\n",
    "\n",
    "    def run_pagerank(self) -> any:\n",
    "        \"\"\"\n",
    "        @param self\n",
    "        @return result is the dataframe from the pagerank\n",
    "        \"\"\"\n",
    "        result = self.driver.session().write_transaction(self.pagerank)\n",
    "        result = pd.DataFrame(result)\n",
    "        return result"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "source": [
    "pagerank = pagerank()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "source": [
    "result = pagerank.run_pagerank()\n",
    "result[:196].to_csv(\"Pagerank_for_unid.csv\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "source": [
    "result[:146]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UniProtID</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>11.168309</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>None</td>\n",
       "      <td>11.161981</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>None</td>\n",
       "      <td>10.781645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>None</td>\n",
       "      <td>10.442585</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>None</td>\n",
       "      <td>9.910084</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>141</th>\n",
       "      <td>None</td>\n",
       "      <td>1.684088</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>142</th>\n",
       "      <td>None</td>\n",
       "      <td>1.681592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>143</th>\n",
       "      <td>None</td>\n",
       "      <td>1.680469</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144</th>\n",
       "      <td>None</td>\n",
       "      <td>1.670963</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145</th>\n",
       "      <td>None</td>\n",
       "      <td>1.666225</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>146 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    UniProtID      score\n",
       "0        None  11.168309\n",
       "1        None  11.161981\n",
       "2        None  10.781645\n",
       "3        None  10.442585\n",
       "4        None   9.910084\n",
       "..        ...        ...\n",
       "141      None   1.684088\n",
       "142      None   1.681592\n",
       "143      None   1.680469\n",
       "144      None   1.670963\n",
       "145      None   1.666225\n",
       "\n",
       "[146 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "execution_count": 157
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "source": [
    "result[:146].to_csv(\"Pagerank\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "orig_nbformat": 4,
  "language_info": {
   "name": "python",
   "version": "3.8.8",
   "mimetype": "text/x-python",
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "pygments_lexer": "ipython3",
   "nbconvert_exporter": "python",
   "file_extension": ".py"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.8 64-bit ('base': conda)"
  },
  "interpreter": {
   "hash": "f93122d913e8da5844ffda4f26bfab2496f68b268ffc1188016d84a6eaadd632"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}